In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('synthetic_salary_dataset.csv')

In [3]:
data.head(5)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR)
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000.0
1,Machine Learning Engineer,12.3,Bachelors,Finance,Bangalore,1488000.0
2,Computer Vision Engineer,4.8,Bachelors,Manufacturing,Remote,897000.0
3,Machine Learning Engineer,1.7,Bachelors,IT,Delhi,676000.0
4,MLOps Engineer,12.4,Masters,Healthcare,Chennai,2416000.0

In [4]:
data.shape

(500, 6)

In [5]:
data.isnull().sum()

Position           0
YearsExperience    0
EducationLevel     0
Industry           0
Location           0
Salary(INR)        0
dtype: int64

In [6]:
data.columns

Index(['Position', 'YearsExperience', 'EducationLevel', 'Industry', 'Location',
       'Salary(INR)'],
      dtype='object')

In [7]:
data[['Position','YearsExperience','Salary(INR)']].sort_values(by='Salary(INR)',ascending=False).head(5)

                          Position  YearsExperience  Salary(INR)
352      Machine Learning Engineer             13.3    2821000.0
50                    NLP Engineer             14.7    2808000.0
8                   Data Scientist             14.9    2803000.0
69   Business Intelligence Analyst             14.9    2791000.0
479                 Data Scientist             13.6    2737000.0

In [8]:
data['Position'].value_counts()

Position
Computer Vision Engineer         62
Business Intelligence Analyst    60
Data Scientist                   56
MLOps Engineer                   50
Software Engineer                48
Data Analyst                     48
AI Researcher                    47
Machine Learning Engineer        47
NLP Engineer                     44
Big Data Engineer                38
Name: count, dtype: int64

In [9]:
import numpy as np

In [10]:
data.groupby('Position')['Salary(INR)'].sum().sort_values(ascending=False).head(5)

Position
Computer Vision Engineer         97626000.0
Business Intelligence Analyst    90126000.0
Data Scientist                   80954000.0
Machine Learning Engineer        76855000.0
Data Analyst                     75541000.0
Name: Salary(INR), dtype: float64

In [11]:
data['Salary(INR)'] = data['Salary(INR)'].astype('int64')

In [12]:
data.head(3)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR)
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000
1,Machine Learning Engineer,12.3,Bachelors,Finance,Bangalore,1488000
2,Computer Vision Engineer,4.8,Bachelors,Manufacturing,Remote,897000

In [13]:
# Q.1 Find all employees who are located in Mumbai and show:Position, YearsExperience, Salary(INR)
data[data['Location']=="Mumbai"][['Position','YearsExperience']]

                          Position  YearsExperience
0                     NLP Engineer              2.8
14                    NLP Engineer              1.5
20                  Data Scientist              1.2
21                  MLOps Engineer             10.7
32                   AI Researcher              3.4
..                             ...              ...
467              Software Engineer              7.8
473                  AI Researcher             13.9
474                 Data Scientist             14.1
482  Business Intelligence Analyst              5.4
498                 Data Scientist              5.5

[82 rows x 2 columns]

In [14]:
# Q.2
data.groupby("EducationLevel")['Salary(INR)'].mean()

EducationLevel
Bachelors    1.346890e+06
Masters      1.536962e+06
PhD          1.708282e+06
Name: Salary(INR), dtype: float64

In [15]:
#Q. 3
def salary_cat(salary):
    if salary > 1000000:
        return "High"
    elif 1000000 < salary > 600000:
        return "Medium"
    else:
        return "Low"

data['salary_category'] = data['Salary(INR)'].apply(salary_cat)

In [16]:
data.head(5)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR),salary_category
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000,High
1,Machine Learning Engineer,12.3,Bachelors,Finance,Bangalore,1488000,High
2,Computer Vision Engineer,4.8,Bachelors,Manufacturing,Remote,897000,Low
3,Machine Learning Engineer,1.7,Bachelors,IT,Delhi,676000,Low
4,MLOps Engineer,12.4,Masters,Healthcare,Chennai,2416000,High

In [17]:
# Q.4 Find employees working in IT industry with more than 5 years of experience, then sort them by Salary(INR) in descending order.
data[
    (data['Industry'] == "IT") & (data['YearsExperience'] > 5)
].sort_values(by= "Salary(INR)",ascending=False).head(5)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR),salary_category
441,Big Data Engineer,13.0,PhD,IT,Mumbai,2652000,High
39,Data Analyst,13.9,Masters,IT,Pune,2547000,High
399,Computer Vision Engineer,13.1,PhD,IT,Bangalore,2467000,High
409,Computer Vision Engineer,12.8,Bachelors,IT,Hyderabad,2209000,High
194,Machine Learning Engineer,14.8,Masters,IT,Chennai,2192000,High

In [18]:
#Q.5 Find how many employees are there in each Industry, and display the result sorted by count (highest first).
data.groupby('Industry')['Position'].count().sort_values(ascending=False)

Industry
Education        99
Manufacturing    90
Healthcare       85
IT               82
Retail           79
Finance          65
Name: Position, dtype: int64

In [19]:
data.columns

Index(['Position', 'YearsExperience', 'EducationLevel', 'Industry', 'Location',
       'Salary(INR)', 'salary_category'],
      dtype='object')

In [20]:
data[data['Location'] == "Mumbai"][["Location","YearsExperience", "Position","Salary(INR)"]].sort_values(by="Salary(INR)", ascending=False)

    Location  YearsExperience                       Position  Salary(INR)
473   Mumbai             13.9                  AI Researcher      2718000
441   Mumbai             13.0              Big Data Engineer      2652000
474   Mumbai             14.1                 Data Scientist      2621000
370   Mumbai             13.7              Software Engineer      2582000
427   Mumbai             14.1                 MLOps Engineer      2514000
..       ...              ...                            ...          ...
378   Mumbai              1.9                  AI Researcher       698000
112   Mumbai              1.5              Software Engineer       696000
173   Mumbai              1.5  Business Intelligence Analyst       618000
264   Mumbai              0.9                 MLOps Engineer       520000
20    Mumbai              1.2                 Data Scientist       487000

[82 rows x 4 columns]

In [21]:
data.head()

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR),salary_category
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000,High
1,Machine Learning Engineer,12.3,Bachelors,Finance,Bangalore,1488000,High
2,Computer Vision Engineer,4.8,Bachelors,Manufacturing,Remote,897000,Low
3,Machine Learning Engineer,1.7,Bachelors,IT,Delhi,676000,Low
4,MLOps Engineer,12.4,Masters,Healthcare,Chennai,2416000,High

In [25]:
#Q.1
data[data["Location"] == "Bangalore"][["Position","EducationLevel","Salary(INR)"]]

                          Position EducationLevel  Salary(INR)
1        Machine Learning Engineer      Bachelors      1488000
17                   AI Researcher            PhD      1098000
24               Big Data Engineer      Bachelors      1411000
28        Computer Vision Engineer        Masters      1617000
33                  MLOps Engineer      Bachelors      1090000
..                             ...            ...          ...
461  Business Intelligence Analyst      Bachelors      1588000
462                 Data Scientist        Masters      1171000
476      Machine Learning Engineer            PhD      1893000
490       Computer Vision Engineer            PhD      1448000
499                   Data Analyst      Bachelors       925000

[75 rows x 3 columns]

In [26]:
#Q.2
data.groupby("Industry")["YearsExperience"].mean()

Industry
Education        8.360606
Finance          7.966154
Healthcare       8.672941
IT               7.157317
Manufacturing    7.828889
Retail           8.079747
Name: YearsExperience, dtype: float64

In [ ]:
#Q.3
data["Experience_Level"] = np.where(data["YearsExperience"] >= 10, "Senior",
                                    np.where(data["YearsExperience"].between(5, 10), "Mid",
                                             "Junior"))

In [29]:
#Q.4
data.sort_values(by="YearsExperience", ascending=True)

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR),salary_category,Experience_Level
30,MLOps Engineer,0.5,Masters,IT,Hyderabad,676000,Low,Junior
71,Data Scientist,0.6,PhD,Manufacturing,Mumbai,875000,Low,Junior
387,Big Data Engineer,0.7,PhD,Healthcare,Delhi,938000,Low,Junior
48,Big Data Engineer,0.7,Masters,Finance,Bangalore,744000,Low,Junior
283,Computer Vision Engineer,0.7,PhD,IT,Hyderabad,925000,Low,Junior
...,...,...,...,...,...,...,...,...
402,Computer Vision Engineer,14.9,Bachelors,IT,Delhi,1970000,High,Senior
350,Data Scientist,15.0,PhD,Healthcare,Remote,2074000,High,Senior
468,Computer Vision Engineer,15.0,Bachelors,Finance,Hyderabad,2634000,High,Senior
70,NLP Engineer,15.0,Masters,Retail,Hyderabad,2389000,High,Senior
216,Business Intelligence Analyst,15.0,Bachelors,Healthcare,Remote,2612000,High,Senior

In [32]:
#Q.5
data.groupby("Location")["Position"].count()

Location
Bangalore    75
Chennai      71
Delhi        71
Hyderabad    77
Mumbai       82
Pune         67
Remote       57
Name: Position, dtype: int64

In [34]:
data.Location.value_counts().sort_values(ascending=False)

Location
Mumbai       82
Hyderabad    77
Bangalore    75
Chennai      71
Delhi        71
Pune         67
Remote       57
Name: count, dtype: int64

In [36]:
#Q.6 Find all employees whose Salary(INR) is between 700,000 and 1,500,000, and show:Position, Industry, Salary(INR)
data[data["Salary(INR)"].between(700000, 1500000)][["Position", "Industry", "Salary(INR)"]]

                      Position       Industry  Salary(INR)
0                 NLP Engineer        Finance      1288000
1    Machine Learning Engineer        Finance      1488000
2     Computer Vision Engineer  Manufacturing       897000
7                 NLP Engineer     Healthcare      1361000
9            Software Engineer      Education       814000
..                         ...            ...          ...
485               Data Analyst     Healthcare      1285000
488          Big Data Engineer  Manufacturing      1467000
490   Computer Vision Engineer        Finance      1448000
494               Data Analyst        Finance      1051000
499               Data Analyst     Healthcare       925000

[217 rows x 3 columns]

In [37]:
#Q.7 Q2️⃣ (GroupBy + Multiple Aggregations) For each Industry, calculate:
#Average Salary
#Median Salary
#Maximum Salary
data.groupby("Industry")["Salary(INR)"].agg(['mean','median','max'])

                       mean     median      max
Industry
Education      1.523232e+06  1538000.0  2808000
Finance        1.608985e+06  1554000.0  2737000
Healthcare     1.624494e+06  1650000.0  2821000
IT             1.375122e+06  1363500.0  2652000
Manufacturing  1.497300e+06  1548500.0  2635000
Retail         1.531899e+06  1475000.0  2722000

In [38]:
#Q.8
import numpy as np
data['Salary_Band'] = np.where(data['Salary(INR)'] >= 1500000, "Very High",
                               np.where(data['Salary(INR)'].between(1000000 , 1499999), "High", 
                                        np.where(data['Salary(INR)'].between(600000, 999999), "Medium", "Low")))

In [50]:
#Q.9
data[(data["EducationLevel"].isin(values=['Masters']) | (data['EducationLevel'].isin(values=['PhD'])))]

,Position,YearsExperience,EducationLevel,Industry,Location,Salary(INR),Salary_Band
0,NLP Engineer,2.8,PhD,Finance,Mumbai,1288000,High
4,MLOps Engineer,12.4,Masters,Healthcare,Chennai,2416000,Very High
5,Computer Vision Engineer,9.5,PhD,Education,Remote,2083000,Very High
6,Machine Learning Engineer,7.6,PhD,Healthcare,Remote,1891000,Very High
7,NLP Engineer,6.7,Masters,Healthcare,Chennai,1361000,High
...,...,...,...,...,...,...,...
492,Data Analyst,13.6,Masters,IT,Hyderabad,2040000,Very High
493,Big Data Engineer,8.3,PhD,Healthcare,Chennai,1571000,Very High
495,Computer Vision Engineer,8.0,PhD,Finance,Pune,1899000,Very High
496,AI Researcher,8.5,PhD,IT,Delhi,1526000,Very High
498,Data Scientist,5.5,PhD,Manufacturing,Mumbai,1556000,Very High

In [46]:
#Q.10 Find the number of employees per EducationLevel, then sort the result from highest count to lowest.
data.groupby("EducationLevel")['Position'].count().sort_values(ascending=False)

EducationLevel
Bachelors    181
PhD          163
Masters      156
Name: Position, dtype: int64